; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	spectrograph2 - mode
	image0 - mode
	thermograph1 - mode
	infrared3 - mode
	Star0 - direction
	Star1 - direction
	Planet2 - direction
	Star3 - direction
	Planet4 - direction
	Planet5 - direction
)
(:init
	(supports instrument0 spectrograph2)
	(supports instrument0 infrared3)
	(supports instrument0 thermograph1)
	(supports instrument0 image0)
	(calibration_target instrument0 Star1)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star1)
)
(:goal (and
	(pointing satellite0 Planet4)
	(have_image Planet2 infrared3)
	(have_image Star3 infrared3)
	(have_image Planet4 infrared3)
	(have_image Planet5 image0)
))

)

; plan
1. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 5
2. (calibrate satellite0 instrument0 star1)
   added: (calibrated instrument0)
   goals met: 0 of 5
3. (turn_to satellite0 planet2 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 planet2)
   goals met: 0 of 5
4. (take_image satellite0 planet2 instrument0 infrared3)
   added: (have_image planet2 infrared3)
   goals met: 1 of 5
5. (turn_to satellite0 planet4 planet2)
   deleted: (pointing satellite0 planet2)
   added: (pointing satellite0 planet4)
   goals met: 2 of 5
6. (take_image satellite0 planet4 instrument0 infrared3)
   added: (have_image planet4 infrared3)
   goals met: 3 of 5
7. (turn_to satellite0 planet5 planet4)
   deleted: (pointing satellite0 planet4)
   added: (pointing satellite0 planet5)
   goals met: 2 of 5
8. (take_image satellite0 planet5 instrument0 image0)
   added: (have_image planet5 image0)
   goals met: 3 of 5
9. (turn_to satellite0 planet4 planet5)
   deleted: (pointing satellite0 planet5)
   added: (pointing satellite0 planet4)
   goals met: 4 of 5
10. (turn_to satellite0 star3 planet4)
   deleted: (pointing satellite0 planet4)
   added: (pointing satellite0 star3)
   goals met: 3 of 5
11. (take_image satellite0 star3 instrument0 infrared3)
   added: (have_image star3 infrared3)
   goals met: 4 of 5
12. (turn_to satellite0 planet4 star3)
   deleted: (pointing satellite0 star3)
   added: (pointing satellite0 planet4)
   goals met: 5 of 5
